open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_tim.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_tim.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 ****************************************************************************/

/* ADR-027: General-purpose timer (TIM2) lower-half driver.
 *
 * This delivers the timing / periodic-interrupt function of ADR-027 via
 * the NuttX timer character framework (/dev/timerN).  TIM2 is a 32-bit
 * general-purpose timer on APB1; its 32-bit auto-reload avoids counter
 * cascading and gives a very large maximum timeout at a 1 MHz tick.
 *
 * The timer is driven at a fixed 1 MHz tick (1 us resolution) by
 * programming PSC from the APB1 timer input clock, so timeout values map
 * directly to microseconds regardless of the running core clock.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/timers/timer.h>
#include <nuttx/spinlock.h>

#ifdef CONFIG_STM32_TIM3_PWM
#  include <nuttx/timers/pwm.h>
#endif
#ifdef CONFIG_STM32_TIM15_CAP
#  include <nuttx/clock.h>
#  include <nuttx/timers/capture.h>
#endif

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32n6_tim.h"
#include "hardware/stm32_tim.h"
#include "hardware/stm32_rcc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Fixed 1 MHz tick: 1 microsecond per counter increment */

#define STM32N6_TIM_TICK_FREQ  1000000

/* TIM2 is a 32-bit counter, so the maximum timeout at a 1 us tick is the
 * full 32-bit range expressed in microseconds.
 */

#define STM32N6_TIM_MAXTIMEOUT 0xffffffffull

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32n6_tim_lowerhalf_s
{
  const struct timer_ops_s *ops;      /* Lower-half ops (must be 1st) */
  uint32_t                  base;     /* Timer register base address */
  uint32_t                  timclk;   /* Timer input clock (Hz) */
  int                       irq;      /* Timer update IRQ number */
  tccb_t                    callback; /* Upper-half timeout callback */
  void                     *arg;      /* Argument for the callback */
  uint32_t                  timeout;  /* Current timeout (microseconds) */
  bool                      started;  /* True when the timer is running */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  stm32n6_tim_start(struct timer_lowerhalf_s *lower);
static int  stm32n6_tim_stop(struct timer_lowerhalf_s *lower);
static int  stm32n6_tim_getstatus(struct timer_lowerhalf_s *lower,
                                   struct timer_status_s *status);
static int  stm32n6_tim_settimeout(struct timer_lowerhalf_s *lower,
                                    uint32_t timeout);
static void stm32n6_tim_setcallback(struct timer_lowerhalf_s *lower,
                                     tccb_t callback, void *arg);
static int  stm32n6_tim_maxtimeout(struct timer_lowerhalf_s *lower,
                                    uint32_t *maxtimeout);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct timer_ops_s g_stm32n6_tim_ops =
{
  .start      = stm32n6_tim_start,
  .stop       = stm32n6_tim_stop,
  .getstatus  = stm32n6_tim_getstatus,
  .settimeout = stm32n6_tim_settimeout,
  .setcallback = stm32n6_tim_setcallback,
  .maxtimeout = stm32n6_tim_maxtimeout,
};

#ifdef CONFIG_STM32_TIM2
static struct stm32n6_tim_lowerhalf_s g_tim2_lowerhalf =
{
  .ops    = &g_stm32n6_tim_ops,
  .base   = STM32_TIM2_BASE,
  .timclk = STM32_APB1_TIM_FREQUENCY,
  .irq    = STM32_IRQ_TIM2,
};
#endif

static spinlock_t g_tim_lock = SP_UNLOCKED;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_tim_enableclk
 *
 * Description:
 *   Enable the APB1 peripheral clock feeding this timer.  Without this a
 *   register write is silently dropped and reads return zero.
 *
 ****************************************************************************/

static void stm32n6_tim_enableclk(struct stm32n6_tim_lowerhalf_s *priv)
{
  irqstate_t flags;
  uint32_t regval;

  flags = spin_lock_irqsave(&g_tim_lock);

#ifdef CONFIG_STM32_TIM2
  if (priv->base == STM32_TIM2_BASE)
    {
      regval  = getreg32(STM32_RCC_APB1ENR1);
      regval |= RCC_APB1ENR1_TIM2EN;
      putreg32(regval, STM32_RCC_APB1ENR1);

      /* Also keep the clock alive across CPU Sleep (WFI); otherwise the
       * counter freezes while a task blocks and never fires the update
       * interrupt that is supposed to wake it.
       */

      regval  = getreg32(STM32_RCC_APB1LPENR1);
      regval |= RCC_APB1LPENR1_TIM2LPEN;
      putreg32(regval, STM32_RCC_APB1LPENR1);
    }
#endif

  spin_unlock_irqrestore(&g_tim_lock, flags);
}

/****************************************************************************
 * Name: stm32n6_tim_interrupt
 *
 * Description:
 *   Common timer update interrupt handler.  Acknowledges the update flag
 *   and invokes the registered upper-half callback.  A periodic callback
 *   may adjust the next interval; a NULL or non-reloading callback stops
 *   the timer.
 *
 ****************************************************************************/

static int stm32n6_tim_interrupt(int irq, void *context, void *arg)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)arg;
  uint32_t sr;

  DEBUGASSERT(priv != NULL);

