open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_tim.c
  sr = getreg32(priv->base + STM32_TIM_SR_OFFSET);
  if ((sr & TIM_SR_UIF) == 0)
    {
      return OK;
    }

  /* Acknowledge the update interrupt (rc_w0: write 0 to clear) */

  putreg32(~TIM_SR_UIF, priv->base + STM32_TIM_SR_OFFSET);

  if (priv->callback != NULL)
    {
      uint32_t next = priv->timeout;

      if (priv->callback(&next, priv->arg))
        {
          /* Reload: honour a possibly-updated interval */

          if (next != priv->timeout)
            {
              stm32n6_tim_settimeout(
                (struct timer_lowerhalf_s *)priv, next);
            }
        }
      else
        {
          stm32n6_tim_stop((struct timer_lowerhalf_s *)priv);
        }
    }
  else
    {
      stm32n6_tim_stop((struct timer_lowerhalf_s *)priv);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_start
 ****************************************************************************/

static int stm32n6_tim_start(struct timer_lowerhalf_s *lower)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t psc;

  DEBUGASSERT(priv != NULL);

  if (priv->started)
    {
      return -EBUSY;
    }

  /* Feed the timer its peripheral clock before touching any register */

  stm32n6_tim_enableclk(priv);

  flags = spin_lock_irqsave(&g_tim_lock);

  /* Stop the counter while (re)configuring */

  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);

  /* Program the prescaler for a 1 MHz tick (1 us resolution) */

  psc = (priv->timclk / STM32N6_TIM_TICK_FREQ) - 1;
  putreg32(psc, priv->base + STM32_TIM_PSC_OFFSET);

  /* Program the auto-reload authoritatively here.  settimeout() may have
   * run while the peripheral clock was still gated (its ARR write silently
   * dropped), so re-apply it now that the clock is guaranteed live.  An
   * ARR of 0 would freeze the counter and never raise an update event.
   */

  if (priv->timeout != 0)
    {
      putreg32(priv->timeout - 1, priv->base + STM32_TIM_ARR_OFFSET);
    }

  /* Only counter overflow generates an update interrupt (URS), and the
   * auto-reload value is preloaded (ARPE).
   */

  putreg32(TIM_CR1_URS | TIM_CR1_ARPE,
           priv->base + STM32_TIM_CR1_OFFSET);

  /* Force an update event to load PSC/ARR.  UG sets UIF (and, with CNT and
   * the compare registers both zero, the capture/compare flags) regardless
   * of URS, so clear the entire status register afterwards.  Enabling UIE
   * with a stale UIF still latched would fire the ISR immediately and, if
   * the flag is not fully drained, storm.
   */

  putreg32(TIM_EGR_UG, priv->base + STM32_TIM_EGR_OFFSET);
  putreg32(0, priv->base + STM32_TIM_SR_OFFSET);

  /* Enable the update interrupt and start counting */

  putreg32(TIM_DIER_UIE, priv->base + STM32_TIM_DIER_OFFSET);
  modifyreg32(priv->base + STM32_TIM_CR1_OFFSET, 0, TIM_CR1_CEN);

  priv->started = true;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  up_enable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_stop
 ****************************************************************************/

static int stm32n6_tim_stop(struct timer_lowerhalf_s *lower)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  if (!priv->started)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&g_tim_lock);

  /* Disable the update interrupt, stop the counter, clear pending flag */

  putreg32(0, priv->base + STM32_TIM_DIER_OFFSET);
  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);
  putreg32(~TIM_SR_UIF, priv->base + STM32_TIM_SR_OFFSET);

  priv->started = false;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  up_disable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_getstatus
 ****************************************************************************/

static int stm32n6_tim_getstatus(struct timer_lowerhalf_s *lower,
                                  struct timer_status_s *status)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)lower;
  uint32_t arr;
  uint32_t cnt;

  DEBUGASSERT(priv != NULL && status != NULL);

  status->flags = 0;
  if (priv->started)
    {
      status->flags |= TCFLAGS_ACTIVE;
    }

  if (priv->callback != NULL)
    {
      status->flags |= TCFLAGS_HANDLER;
    }

  status->timeout = priv->timeout;

  /* Time remaining until expiry, in microseconds (1 tick == 1 us) */

  arr = getreg32(priv->base + STM32_TIM_ARR_OFFSET);
  cnt = getreg32(priv->base + STM32_TIM_CNT_OFFSET);
  status->timeleft = (arr >= cnt) ? (arr - cnt) : 0;

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_settimeout
 ****************************************************************************/

static int stm32n6_tim_settimeout(struct timer_lowerhalf_s *lower,
                                   uint32_t timeout)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  if (timeout == 0 || timeout > STM32N6_TIM_MAXTIMEOUT)
    {
      return -EINVAL;
    }

  flags = spin_lock_irqsave(&g_tim_lock);

  priv->timeout = timeout;

  /* 1 tick == 1 us, so the reload value is (timeout - 1) counts */

  putreg32(timeout - 1, priv->base + STM32_TIM_ARR_OFFSET);

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_setcallback
 ****************************************************************************/

static void stm32n6_tim_setcallback(struct timer_lowerhalf_s *lower,
                                     tccb_t callback, void *arg)
{
  struct stm32n6_tim_lowerhalf_s *priv =
    (struct stm32n6_tim_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  flags = spin_lock_irqsave(&g_tim_lock);
  priv->callback = callback;
  priv->arg      = arg;
  spin_unlock_irqrestore(&g_tim_lock, flags);
}

/****************************************************************************
 * Name: stm32n6_tim_maxtimeout
 ****************************************************************************/

static int stm32n6_tim_maxtimeout(struct timer_lowerhalf_s *lower,
                                   uint32_t *maxtimeout)
{
  DEBUGASSERT(maxtimeout != NULL);

