open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_tim.c
  *maxtimeout = (uint32_t)STM32N6_TIM_MAXTIMEOUT;
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_timer_initialize
 *
 * Description:
 *   Bind a general-purpose timer to a character device and register it.
 *
 * Input Parameters:
 *   devpath - Character device path (e.g. "/dev/timer0").
 *   timer   - Timer peripheral number (currently only 2 is supported).
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

int stm32n6_timer_initialize(const char *devpath, int timer)
{
  struct stm32n6_tim_lowerhalf_s *priv;
  void *handle;

  DEBUGASSERT(devpath != NULL);

  switch (timer)
    {
#ifdef CONFIG_STM32_TIM2
      case 2:
        priv = &g_tim2_lowerhalf;
        break;
#endif

      default:
        return -ENODEV;
    }

  /* Attach the update ISR (kept disabled at the NVIC until start) */

  irq_attach(priv->irq, stm32n6_tim_interrupt, priv);

  handle = timer_register(devpath, (struct timer_lowerhalf_s *)priv);
  if (handle == NULL)
    {
      irq_detach(priv->irq);
      return -EEXIST;
    }

  return OK;
}

#ifdef CONFIG_STM32_TIM3_PWM

/****************************************************************************
 * TIM3 PWM output lower-half (ADR-027)
 *
 * Drives the TIM3_CH1 compare output as a plain single-channel PWM in PWM
 * mode 1.  The waveform is autonomous (no interrupt needed) and is routed
 * on-chip into TIM15 TI1 through TISEL for the wire-free capture loopback.
 ****************************************************************************/

struct stm32n6_pwm_lowerhalf_s
{
  const struct pwm_ops_s *ops;      /* Lower-half ops (must be 1st) */
  uint32_t                base;     /* Timer register base address */
  uint32_t                timclk;   /* Timer input clock (Hz) */
  bool                    started;  /* True when output is running */
};

static int stm32n6_pwm_setup(struct pwm_lowerhalf_s *dev);
static int stm32n6_pwm_shutdown(struct pwm_lowerhalf_s *dev);
static int stm32n6_pwm_start(struct pwm_lowerhalf_s *dev,
                             const struct pwm_info_s *info);
static int stm32n6_pwm_stop(struct pwm_lowerhalf_s *dev);
static int stm32n6_pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                             unsigned long arg);

static const struct pwm_ops_s g_stm32n6_pwm_ops =
{
  .setup    = stm32n6_pwm_setup,
  .shutdown = stm32n6_pwm_shutdown,
  .start    = stm32n6_pwm_start,
  .stop     = stm32n6_pwm_stop,
  .ioctl    = stm32n6_pwm_ioctl,
};

static struct stm32n6_pwm_lowerhalf_s g_tim3_pwm_lowerhalf =
{
  .ops    = &g_stm32n6_pwm_ops,
  .base   = STM32_TIM3_BASE,
  .timclk = STM32_APB1_TIM_FREQUENCY,
};

/****************************************************************************
 * Name: stm32n6_pwm_setup
 ****************************************************************************/

static int stm32n6_pwm_setup(struct pwm_lowerhalf_s *dev)
{
  irqstate_t flags;
  uint32_t regval;

  /* Enable the TIM3 APB1 peripheral clock (and keep it alive across CPU
   * Sleep so the waveform never gates while a task blocks).
   */

  flags = spin_lock_irqsave(&g_tim_lock);

  regval  = getreg32(STM32_RCC_APB1ENR1);
  regval |= RCC_APB1ENR1_TIM3EN;
  putreg32(regval, STM32_RCC_APB1ENR1);

  regval  = getreg32(STM32_RCC_APB1LPENR1);
  regval |= RCC_APB1LPENR1_TIM3LPEN;
  putreg32(regval, STM32_RCC_APB1LPENR1);

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_pwm_shutdown
 ****************************************************************************/

static int stm32n6_pwm_shutdown(struct pwm_lowerhalf_s *dev)
{
  return stm32n6_pwm_stop(dev);
}

/****************************************************************************
 * Name: stm32n6_pwm_start
 ****************************************************************************/

static int stm32n6_pwm_start(struct pwm_lowerhalf_s *dev,
                             const struct pwm_info_s *info)
{
  struct stm32n6_pwm_lowerhalf_s *priv =
    (struct stm32n6_pwm_lowerhalf_s *)dev;
  irqstate_t flags;
  uint32_t psc;
  uint32_t period;
  uint32_t ccr;

  DEBUGASSERT(priv != NULL && info != NULL);

  if (info->frequency == 0)
    {
      return -EINVAL;
    }

  /* Fixed 1 MHz tick keeps the arithmetic exact for kHz-range outputs and
   * matches the capture timer's tick so the readback maps 1:1.
   */

  psc    = (priv->timclk / STM32N6_TIM_TICK_FREQ) - 1;
  period = STM32N6_TIM_TICK_FREQ / info->frequency;
  if (period == 0)
    {
      return -EINVAL;
    }

  /* duty is a ub16_t fraction of 65536; CCR1 is the active-count. */

  ccr = ((uint64_t)period * info->duty) >> 16;

  flags = spin_lock_irqsave(&g_tim_lock);

  /* Stop the counter while (re)configuring. */

  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);

  putreg32(psc, priv->base + STM32_TIM_PSC_OFFSET);
  putreg32(period - 1, priv->base + STM32_TIM_ARR_OFFSET);
  putreg32(ccr, priv->base + STM32_TIM_CCR1_OFFSET);

  /* PWM mode 1 on CH1 with output-compare preload enabled. */

  modifyreg32(priv->base + STM32_TIM_CCMR1_OFFSET,
              TIM_CCMR1_OC1M_MASK,
              TIM_CCMR1_OC1M_PWM1 | TIM_CCMR1_OC1PE);

  /* Enable CH1 output. */

  modifyreg32(priv->base + STM32_TIM_CCER_OFFSET, 0, TIM_CCER_CC1E);

  /* Emit the update event as the trigger output (TRGO) so exactly one
   * tim3_trgo pulse is produced per PWM period, driving the inter-timer
   * link (tim3_trgo -> TIM15 ITR2).  The counter output-compare (CCR1)
   * still shapes the PWM waveform on CH1; UPDATE is chosen for TRGO
   * because it gives an unambiguous one-pulse-per-period tick, whereas
   * OC1REF is level-based and double-counts in external-clock mode.
   */

