open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_tim.c
  modifyreg32(priv->base + STM32_TIM_CR2_OFFSET,
              TIM_CR2_MMS_MASK, TIM_CR2_MMS_UPDATE);

  /* Load PSC/ARR/CCR via an update event, then clear stale flags. */

  putreg32(TIM_EGR_UG, priv->base + STM32_TIM_EGR_OFFSET);
  putreg32(0, priv->base + STM32_TIM_SR_OFFSET);

  /* Preload the auto-reload and start counting. */

  putreg32(TIM_CR1_ARPE | TIM_CR1_CEN,
           priv->base + STM32_TIM_CR1_OFFSET);

  priv->started = true;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_pwm_stop
 ****************************************************************************/

static int stm32n6_pwm_stop(struct pwm_lowerhalf_s *dev)
{
  struct stm32n6_pwm_lowerhalf_s *priv =
    (struct stm32n6_pwm_lowerhalf_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  flags = spin_lock_irqsave(&g_tim_lock);

  modifyreg32(priv->base + STM32_TIM_CCER_OFFSET, TIM_CCER_CC1E, 0);
  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);
  putreg32(0, priv->base + STM32_TIM_SR_OFFSET);

  priv->started = false;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_pwm_ioctl
 ****************************************************************************/

static int stm32n6_pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                             unsigned long arg)
{
  return -ENOTTY;
}

/****************************************************************************
 * Name: stm32n6_tim_pwm_initialize
 ****************************************************************************/

int stm32n6_tim_pwm_initialize(const char *devpath)
{
  DEBUGASSERT(devpath != NULL);

  return pwm_register(devpath,
                      (struct pwm_lowerhalf_s *)&g_tim3_pwm_lowerhalf);
}

#endif /* CONFIG_STM32_TIM3_PWM */

#ifdef CONFIG_STM32_TIM15_CAP

/****************************************************************************
 * TIM15 inter-timer frequency counter lower-half (ADR-027)
 *
 * Reads back the TIM3 PWM waveform through the on-chip inter-timer trigger
 * link, with zero external wiring.  TIM3 emits its OC1REF compare waveform
 * as its trigger output (tim3_trgo); TIM15 selects that trigger as ITR2 and
 * runs in external-clock mode 1, so its counter advances by exactly one
 * count per PWM period.  Frequency is then the counted pulses divided by
 * the elapsed time.
 *
 * Note: this path measures frequency (and hence proves the PWM output +
 * inter-timer routing) but not duty cycle -- the TI-input capture mux that
 * would latch the high time does not carry the internal signal on this
 * silicon (RM0486 Table 538 lists TIM3_CH1 on tim_ti1_in2, but the tap is
 * inert in practice), so the OC1REF->ITR2 trigger link is used instead.
 ****************************************************************************/

struct stm32n6_cap_lowerhalf_s
{
  const struct cap_ops_s *ops;      /* Lower-half ops (must be 1st) */
  uint32_t                base;     /* Timer register base address */
  uint32_t                timclk;   /* Timer input clock (Hz) */
  clock_t                 t0;       /* Tick count when counting began */
  bool                    started;  /* True when counting is running */
};

static int stm32n6_cap_start(struct cap_lowerhalf_s *lower);
static int stm32n6_cap_stop(struct cap_lowerhalf_s *lower);
static int stm32n6_cap_getduty(struct cap_lowerhalf_s *lower,
                               uint8_t *duty);
static int stm32n6_cap_getfreq(struct cap_lowerhalf_s *lower,
                               uint32_t *freq);
static int stm32n6_cap_getedges(struct cap_lowerhalf_s *lower,
                                uint32_t *edges);

static const struct cap_ops_s g_stm32n6_cap_ops =
{
  .start    = stm32n6_cap_start,
  .stop     = stm32n6_cap_stop,
  .getduty  = stm32n6_cap_getduty,
  .getfreq  = stm32n6_cap_getfreq,
  .getedges = stm32n6_cap_getedges,
};

static struct stm32n6_cap_lowerhalf_s g_tim15_cap_lowerhalf =
{
  .ops    = &g_stm32n6_cap_ops,
  .base   = STM32_TIM15_BASE,
  .timclk = STM32_APB2_TIM_FREQUENCY,
};

/****************************************************************************
 * Name: stm32n6_cap_start
 ****************************************************************************/

static int stm32n6_cap_start(struct cap_lowerhalf_s *lower)
{
  struct stm32n6_cap_lowerhalf_s *priv =
    (struct stm32n6_cap_lowerhalf_s *)lower;
  irqstate_t flags;
  uint32_t regval;

  DEBUGASSERT(priv != NULL);

  /* Enable the TIM15 APB2 peripheral clock (kept alive across CPU Sleep). */

  flags = spin_lock_irqsave(&g_tim_lock);

  /* APB2ENR is READ-ONLY status on STM32N6; use the APB2ENSR
   * write-1-to-set alias to open the TIM15 clock gate. */
  putreg32(RCC_APB2ENR_TIM15EN, STM32_RCC_APB2ENSR);

  regval  = getreg32(STM32_RCC_APB2LPENR);
  regval |= RCC_APB2LPENR_TIM15LPEN;
  putreg32(regval, STM32_RCC_APB2LPENR);

  /* Stop the counter while (re)configuring. */

  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);

  /* Count every trigger tick (no prescaler) over the full 16-bit range. */

  putreg32(0, priv->base + STM32_TIM_PSC_OFFSET);
  putreg32(0xffff, priv->base + STM32_TIM_ARR_OFFSET);

  /* External clock mode 1 off ITR2 (tim3_trgo): each TIM3 period advances
   * the TIM15 counter by one.  SMS = external clock mode 1, TS = ITR2.
   */

  regval  = getreg32(priv->base + STM32_TIM_SMCR_OFFSET);
  regval &= ~(TIM_SMCR_SMS_MASK | TIM_SMCR_TS_MASK);
  regval |= TIM_SMCR_TS_ITR2 | TIM_SMCR_SMS_EXTCLK1;
  putreg32(regval, priv->base + STM32_TIM_SMCR_OFFSET);

  /* Load PSC/ARR via an update event, then clear the counter and flags. */

  putreg32(TIM_EGR_UG, priv->base + STM32_TIM_EGR_OFFSET);
  putreg32(0, priv->base + STM32_TIM_CNT_OFFSET);
  putreg32(0, priv->base + STM32_TIM_SR_OFFSET);

  /* Enable the counter; it now advances on each tim3_trgo pulse. */

  modifyreg32(priv->base + STM32_TIM_CR1_OFFSET, 0, TIM_CR1_CEN);

  priv->t0      = clock_systime_ticks();
  priv->started = true;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_cap_stop
 ****************************************************************************/

static int stm32n6_cap_stop(struct cap_lowerhalf_s *lower)
{
  struct stm32n6_cap_lowerhalf_s *priv =
    (struct stm32n6_cap_lowerhalf_s *)lower;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL);

  flags = spin_lock_irqsave(&g_tim_lock);

