open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_tim.c
  putreg32(0, priv->base + STM32_TIM_CR1_OFFSET);
  putreg32(0, priv->base + STM32_TIM_SR_OFFSET);

  priv->started = false;

  spin_unlock_irqrestore(&g_tim_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_cap_getfreq
 ****************************************************************************/

static int stm32n6_cap_getfreq(struct cap_lowerhalf_s *lower,
                               uint32_t *freq)
{
  struct stm32n6_cap_lowerhalf_s *priv =
    (struct stm32n6_cap_lowerhalf_s *)lower;
  uint32_t pulses;
  uint32_t elapsed_us;

  DEBUGASSERT(priv != NULL && freq != NULL);

  /* Pulses counted since start, over the elapsed wall-clock time, give the
   * PWM frequency directly (one count per TIM3 period).
   */

  pulses     = getreg32(priv->base + STM32_TIM_CNT_OFFSET);
  elapsed_us = (uint32_t)TICK2USEC(clock_systime_ticks() - priv->t0);

  if (elapsed_us == 0)
    {
      *freq = 0;
    }
  else
    {
      *freq = (uint32_t)(((uint64_t)pulses * 1000000ull) / elapsed_us);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_cap_getduty
 ****************************************************************************/

static int stm32n6_cap_getduty(struct cap_lowerhalf_s *lower,
                               uint8_t *duty)
{
  DEBUGASSERT(duty != NULL);

  /* Duty is not observable through the inter-timer trigger link (only one
   * edge per period reaches the counter), so report 0.
   */

  *duty = 0;

  return OK;
}

/****************************************************************************
 * Name: stm32n6_cap_getedges
 ****************************************************************************/

static int stm32n6_cap_getedges(struct cap_lowerhalf_s *lower,
                                uint32_t *edges)
{
  struct stm32n6_cap_lowerhalf_s *priv =
    (struct stm32n6_cap_lowerhalf_s *)lower;

  DEBUGASSERT(priv != NULL && edges != NULL);

  /* Each counted trigger pulse is one PWM period, i.e. one rising edge. */

  *edges = getreg32(priv->base + STM32_TIM_CNT_OFFSET);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_tim_cap_initialize
 ****************************************************************************/

int stm32n6_tim_cap_initialize(const char *devpath)
{
  struct stm32n6_cap_lowerhalf_s *priv = &g_tim15_cap_lowerhalf;

  DEBUGASSERT(devpath != NULL);

  return cap_register(devpath, (struct cap_lowerhalf_s *)priv);
}

#endif /* CONFIG_STM32_TIM15_CAP */
